SQL Springboard Mini-Project
=============

Welcome to the SQL mini project. For this project, you will use
Springboard' online SQL platform, which you can log into through the
following link:

    https://sql.springboard.com/
    Username: student
    Password: learn_sql@springboard

    The data you need is in the "country_club" database. This database
    contains 3 tables:
        i) the "Bookings" table,
        ii) the "Facilities" table, and
        iii) the "Members" table.

**Note:** *if you need to, you can also download these tables locally.*

In the mini project, you'll be asked a series of questions. You can
solve them using the platform, but for the final deliverable,
paste the code for each solution into this script, and upload it
to your GitHub.

Before starting with the questions, feel free to take your time,
exploring the data, and getting acquainted with the 3 tables.

phpMyAdmin SQL Dump to CSV then upload to Pandas
-----------------------------

For this project I have chosen to download the data and do the SQL work locally on my machine. This would give me an opportunity to create the database to be used in the future for examples and work with the data in a familiar environment such as Jupyter Notebooks. Furthermore I also have a personal preference for working with PostgreSQL because it works so well with Python and is ubiquitous; particularly in companies or settings that rely on open-source materials. Lastly, I already have PostGres working on my machine and many of the hoops I have to jump through have already been solved.

*I downloaded the Springboard Database as a CSV and imported it into Pandas*

In [2]:
import warnings
warnings.filterwarnings("ignore")
import psycopg2
import sys
import pandas as pd
import sqlalchemy
import pyodbc
import subprocess
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
Bookings=pd.read_csv('country_club.csv', nrows=4043, header=None)#starting from 0 there are 4042 rows
Bookings.columns=['bookid','facid','memid','starttime','slots']

In [4]:
Bookings.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [5]:
Facilities=pd.read_csv('country_club.csv',skiprows=4043,nrows=9, header=None,error_bad_lines=False)#starting from 0 there are 4042 rows
Facilities.columns=['facid', 'name', 'membercost', 'guestcost', 'initialoutlay', 'monthlymaintenance']
Facilities

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15

In [6]:
Members=pd.read_csv('country_club.csv',skiprows=4052,nrows=30, header=None,error_bad_lines=False)#starting from 0 there are 4042 rows
Members.columns=['memid', 'surname', 'firstname', 'address', 'zipcode', 'telephone', 'recommendedby', 'joindate']
Members.head()

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,NaN,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,NaN,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,NaN,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1.0,2012-07-03 10:25:05

Pandas DataFrames into PostgreSql Database
---------------------

In [32]:
#Enter the values for you database connection
dsn_database = "springboard"          # e.g. "compose"
dsn_hostname = "localhost"            # e.g.: "aws-us-east-1-portal.4.dblayer.com"
dsn_port = "5432"                     # e.g. 11101 
dsn_uid = "postgres"                  # e.g. "admin"
dsn_pwd = "myvoiceismypassportverify" # e.g. "xxx"

try:
    conn_string = "host="+dsn_hostname+" port="+dsn_port+" dbname="+dsn_database+" user="+dsn_uid+" password="+dsn_pwd
    print("Connecting to database....\n")
    conn=psycopg2.connect(conn_string)
    print("Connected!\n")
except:
    print("Unable to connect to the database.")
    
cursor = conn.cursor()
cursor.execute("""SELECT datname from pg_database""")
rows = cursor.fetchall()

print("\nShow me the databases:\n")
for row in rows:
    print("   ", row[0])

Connecting to database....

Connected!


Show me the databases:

    postgres
    template1
    template0
    template_postgis
    springboard

In [33]:
%sql postgresql://postgres:myvoiceismypassportverify@localhost/springboard

'Connected: postgres@springboard'

In [34]:
engine = sqlalchemy.create_engine("postgresql://postgres:geezer@localhost/springboard")

# write the DataFrame to a table in the sql database
Bookings.to_sql("springboard/Bookings", engine,if_exists='replace')
Facilities.to_sql("springboard/Facilities", engine,if_exists='replace')
Members.to_sql("springboard/Members", engine,if_exists='replace')

In [35]:
%sql select * from public."springboard/Bookings" limit 5;

 * postgresql://postgres:***@localhost/springboard
5 rows affected.

[(0, 0, 3, 1, '2012-07-03 11:00:00', 2),
 (1, 1, 4, 1, '2012-07-03 08:00:00', 2),
 (2, 2, 6, 0, '2012-07-03 18:00:00', 2),
 (3, 3, 7, 1, '2012-07-03 19:00:00', 2),
 (4, 4, 8, 1, '2012-07-03 10:00:00', 1)]

*Set Primary Keys*

In [36]:
%sql ALTER TABLE public."springboard/Bookings" ADD PRIMARY KEY (bookid);

 * postgresql://postgres:***@localhost/springboard
Done.

[]

In [37]:
%sql ALTER TABLE public."springboard/Facilities" ADD PRIMARY KEY (facid);

 * postgresql://postgres:***@localhost/springboard
Done.

[]

In [38]:
%sql ALTER TABLE public."springboard/Members" ADD PRIMARY KEY (memid);

 * postgresql://postgres:***@localhost/springboard
Done.

[]

*Drop vestigial index columns*

In [39]:
%sql ALTER TABLE public."springboard/Bookings" DROP COLUMN index;

 * postgresql://postgres:***@localhost/springboard
Done.

[]

In [40]:
%sql ALTER TABLE public."springboard/Facilities" DROP COLUMN index;

 * postgresql://postgres:***@localhost/springboard
Done.

[]

In [41]:
%sql ALTER TABLE public."springboard/Members" DROP COLUMN index;

 * postgresql://postgres:***@localhost/springboard
Done.

[]

**Check Tables**

In [42]:
%sql select * from public."springboard/Bookings" limit 5;

 * postgresql://postgres:***@localhost/springboard
5 rows affected.

[(0, 3, 1, '2012-07-03 11:00:00', 2),
 (1, 4, 1, '2012-07-03 08:00:00', 2),
 (2, 6, 0, '2012-07-03 18:00:00', 2),
 (3, 7, 1, '2012-07-03 19:00:00', 2),
 (4, 8, 1, '2012-07-03 10:00:00', 1)]

In [43]:
%sql select * from public."springboard/Facilities" limit 5;

 * postgresql://postgres:***@localhost/springboard
5 rows affected.

[(0, 'Tennis Court 1', 5.0, 25.0, 10000, 200),
 (1, 'Tennis Court 2', 5.0, 25.0, 8000, 200),
 (2, 'Badminton Court', 0.0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0.0, 5.0, 320, 10),
 (4, 'Massage Room 1', 9.9, 80.0, 4000, 3000)]

In [44]:
%sql select * from public."springboard/Members" limit 5;

 * postgresql://postgres:***@localhost/springboard
5 rows affected.

[(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', None, '2012-07-01 00:00:00'),
 (1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', None, '2012-07-02 12:02:05'),
 (2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', None, '2012-07-02 12:08:23'),
 (3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', None, '2012-07-03 09:32:15'),
 (4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', 1.0, '2012-07-03 10:25:05')]

Springboard Questions
------

**Q1:** *Some of the facilities charge a fee to members, but some do not.
Please list the names of the facilities that do. *

In [45]:
%%sql select name as "No member cost"
from public."springboard/Facilities"
where membercost=0.0;

 * postgresql://postgres:***@localhost/springboard
4 rows affected.

[('Badminton Court',), ('Table Tennis',), ('Snooker Table',), ('Pool Table',)]

**Q2:** *How many facilities do not charge a fee to members? *

In [46]:
%%sql select count(name) as "No fee"
from public."springboard/Facilities"
where membercost=0.0;

 * postgresql://postgres:***@localhost/springboard
1 rows affected.

[(4,)]

**Q3:** *How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. *

In [47]:
%%sql select facid,name,membercost,monthlymaintenance, (membercost/monthlymaintenance)*100 as pct_mo_cost
from public."springboard/Facilities"
where (membercost/monthlymaintenance)*100<20 and 0<(membercost/monthlymaintenance)*100;

 * postgresql://postgres:***@localhost/springboard
5 rows affected.

[(0, 'Tennis Court 1', 5.0, 200, 2.5),
 (1, 'Tennis Court 2', 5.0, 200, 2.5),
 (4, 'Massage Room 1', 9.9, 3000, 0.33),
 (5, 'Massage Room 2', 9.9, 3000, 0.33),
 (6, 'Squash Court', 3.5, 80, 4.375)]

**Q4:** *How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator. *

In [48]:
%%sql select *
from public."springboard/Facilities"
where facid in (1,5) ;

 * postgresql://postgres:***@localhost/springboard
2 rows affected.

[(1, 'Tennis Court 2', 5.0, 25.0, 8000, 200),
 (5, 'Massage Room 2', 9.9, 80.0, 4000, 3000)]

**Q5:** *How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question.*

In [49]:
%%sql select name,monthlymaintenance,
case when monthlymaintenance > 100 then 'expensive' else 'cheap' end as label 
from public."springboard/Facilities";

 * postgresql://postgres:***@localhost/springboard
9 rows affected.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

**Q6:** *You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution.*

In [50]:
%%sql select firstname, surname
from public."springboard/Members"
where joindate in (select max(joindate) from public."springboard/Members");

 * postgresql://postgres:***@localhost/springboard
1 rows affected.

[('Erica', 'Crumpet')]

**Q7:** *How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.*

In [51]:
%%sql select distinct fac.name as court_name, concat(mem.firstname,' ',mem.surname) as member_name 
from public."springboard/Bookings" as book
join public."springboard/Facilities" as fac on fac.facid = book.facid 
join public."springboard/Members" as mem on mem.memid = book.memid
where fac.name in ('Tennis Court 1','Tennis Court 2')
group by court_name,member_name
order by member_name;

 * postgresql://postgres:***@localhost/springboard
46 rows affected.

[('Tennis Court 1', 'Anne Baker'),
 ('Tennis Court 2', 'Anne Baker'),
 ('Tennis Court 1', 'Burton Tracy'),
 ('Tennis Court 2', 'Burton Tracy'),
 ('Tennis Court 1', 'Charles Owen'),
 ('Tennis Court 2', 'Charles Owen'),
 ('Tennis Court 2', 'Darren Smith'),
 ('Tennis Court 1', 'David Farrell'),
 ('Tennis Court 2', 'David Farrell'),
 ('Tennis Court 1', 'David Jones'),
 ('Tennis Court 2', 'David Jones'),
 ('Tennis Court 1', 'David Pinker'),
 ('Tennis Court 1', 'Douglas Jones'),
 ('Tennis Court 1', 'Erica Crumpet'),
 ('Tennis Court 1', 'Florence Bader'),
 ('Tennis Court 2', 'Florence Bader'),
 ('Tennis Court 1', 'Gerald Butters'),
 ('Tennis Court 2', 'Gerald Butters'),
 ('Tennis Court 1', 'GUEST GUEST'),
 ('Tennis Court 2', 'GUEST GUEST'),
 ('Tennis Court 2', 'Henrietta Rumney'),
 ('Tennis Court 1', 'Jack Smith'),
 ('Tennis Court 2', 'Jack Smith'),
 ('Tennis Court 1', 'Janice Joplette'),
 ('Tennis Court 2', 'Janice Joplette'),
 ('Tennis Court 1', 'Jemima Farrell'),
 ('Tennis Court 2', 'Jemima Farrell'),
 ('Tennis Court 1', 'Joan Coplin'),
 ('Tennis Court 1', 'John Hunt'),
 ('Tennis Court 2', 'John Hunt'),
 ('Tennis Court 1', 'Matthew Genting'),
 ('Tennis Court 2', 'Millicent Purview'),
 ('Tennis Court 1', 'Nancy Dare'),
 ('Tennis Court 2', 'Nancy Dare'),
 ('Tennis Court 1', 'Ponder Stibbons'),
 ('Tennis Court 2', 'Ponder Stibbons'),
 ('Tennis Court 1', 'Ramnaresh Sarwin'),
 ('Tennis Court 2', 'Ramnaresh Sarwin'),
 ('Tennis Court 1', 'Tim Boothe'),
 ('Tennis Court 2', 'Tim Boothe'),
 ('Tennis Court 1', 'Tim Rownam'),
 ('Tennis Court 2', 'Tim Rownam'),
 ('Tennis Court 1', 'Timothy Baker'),
 ('Tennis Court 2', 'Timothy Baker'),
 ('Tennis Court 1', 'Tracy Smith'),
 ('Tennis Court 2', 'Tracy Smith')]

**Q8:** *How can you produce a list of bookings on the day of 2012-09-14 where the cost of the member (or guest) is more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. *

In [52]:
%%sql
select fac.name as facility_name, fac.membercost, --fac.guestcost,book.slots, book.starttime, (used for checking/building)
case when mem.surname = 'GUEST' then mem.surname else concat(mem.surname,' ', mem.firstname) end as member_name,
                       -- multiplying cost per day = slot*(guest or member)
case when mem.surname = 'GUEST' then fac.guestcost*book.slots else fac.membercost*book.slots end as cost_per_day
from public."springboard/Bookings" as book
join public."springboard/Facilities" as fac on fac.facid = book.facid 
join public."springboard/Members" as mem on mem.memid = book.memid

where (book.starttime like '2012-09-14%' and mem.memid = 0 AND fac.guestcost > 30) -- guest
or (book.starttime like '2012-09-14%' and mem.memid <> 0 and fac.membercost > 30) -- not guest
order by cost_per_day desc;

 * postgresql://postgres:***@localhost/springboard
4 rows affected.

[('Massage Room 2', 9.9, 'GUEST', 320.0),
 ('Massage Room 1', 9.9, 'GUEST', 160.0),
 ('Massage Room 1', 9.9, 'GUEST', 160.0),
 ('Massage Room 1', 9.9, 'GUEST', 160.0)]

**Q9:** *This time, produce the same result as in Q8, but using a subquery.*

In [53]:
%%sql
select merged.facility_name, merged.member_name, merged.cost_per_day 

from (select book.starttime, concat(mem.firstname,' ',mem.surname) as member_name, fac.name as facility_name, 
case when mem.surname = 'GUEST' then fac.guestcost*book.slots else fac.membercost*book.slots end as cost_per_day 
      
from public."springboard/Bookings" as book 
join public."springboard/Facilities" as fac on fac.facid = book.facid 
join public."springboard/Members" as mem on mem.memid = book.memid) merged 

where merged.starttime like '2012-09-14%' and merged.cost_per_day > 30
order by cost_per_day desc;

 * postgresql://postgres:***@localhost/springboard
12 rows affected.

[('Massage Room 2', 'GUEST GUEST', 320.0),
 ('Massage Room 1', 'GUEST GUEST', 160.0),
 ('Massage Room 1', 'GUEST GUEST', 160.0),
 ('Massage Room 1', 'GUEST GUEST', 160.0),
 ('Tennis Court 2', 'GUEST GUEST', 150.0),
 ('Tennis Court 1', 'GUEST GUEST', 75.0),
 ('Tennis Court 1', 'GUEST GUEST', 75.0),
 ('Tennis Court 2', 'GUEST GUEST', 75.0),
 ('Squash Court', 'GUEST GUEST', 70.0),
 ('Massage Room 1', 'Jemima Farrell', 39.6),
 ('Squash Court', 'GUEST GUEST', 35.0),
 ('Squash Court', 'GUEST GUEST', 35.0)]

**Q10:** *Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! *

In [54]:
%%sql
select merged.facility_name, merged.total_revenue 
from (select fac.name as facility_name, 
      sum(case when mem.memid = 0 then fac.guestcost else fac.membercost end) as total_revenue 
from public."springboard/Bookings" as book
join public."springboard/Facilities" as fac on fac.facid = book.facid 
join public."springboard/Members" as mem on mem.memid = book.memid group by facility_name) merged 
where merged.total_revenue < 1000 
order by total_revenue desc;

 * postgresql://postgres:***@localhost/springboard
4 rows affected.

[('Badminton Court', 604.5),
 ('Pool Table', 265.0),
 ('Snooker Table', 115.0),
 ('Table Tennis', 90.0)]